user-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                           none;
}

gradSchemes
{
    default                           none;

    curl(ARe)                         leastSquares;
    curl(AIm)                         leastSquares;
    snGradCorr(ARe)                   leastSquares;
    snGradCorr(AIm)                   leastSquares;

    grad(VRe)                         leastSquares;
    grad(VIm)                         leastSquares;
    snGradCorr(VRe)                   leastSquares;
    snGradCorr(VIm)                   leastSquares;

    grad(sigma)                       leastSquares;
}

divSchemes
{
    default                           none;
}

laplacianSchemes
{
    default                           none;

    laplacian(ARe)                    Gauss linear corrected; // linear is not used here
    laplacian(AIm)                    Gauss linear corrected; // linear is not used here

    laplacian(sigmaf,VRe)             Gauss linear corrected; // linear is not used here
    laplacian(sigmaf,VIm)             Gauss linear corrected; // linear is not used here
}

interpolationSchemes
{
    default                           none;

    interpolate(sigma)                linear;
}

snGradSchemes
{
    default                           none;
}

// ************************************************************************* //
